In [1]:
import pandas as pd

In [2]:
s=pd.Series([1,2,3,4,5,6,7,8,9])

In [3]:
print(s)

0    1
1    2
2    3
3    4
4    5
5    6
6    7
7    8
8    9
dtype: int64

In [5]:
s%2

0    1
1    0
2    1
3    0
4    1
5    0
6    1
7    0
8    1
dtype: int64

In [6]:
s^2

0     3
1     0
2     1
3     6
4     7
5     4
6     5
7    10
8    11
dtype: int64

In [7]:
s*2

0     2
1     4
2     6
3     8
4    10
5    12
6    14
7    16
8    18
dtype: int64

In [8]:
s**2

0     1
1     4
2     9
3    16
4    25
5    36
6    49
7    64
8    81
dtype: int64

In [32]:
import pandas as pd
df=pd.read_csv("mycsv.csv")
print(df)

    id   name  gender   salary
0    1   aaaa    male    10000
1    2   bbbb  female     8000
2    3  ccccc    male   120000
3    4   dddd    male    45000
4    5   eeee  female   334567
5    6   ffff  female    21234
6    7   gggg  female     2345
7    8   hhhh  female    23456
8    9   iiii    male     7654
9   10    jjj    male  3456578
10  11   kkkk    male    45678
11  12   llll    male      345
12  13   mmmm  female     9876
13  14  nnnnn    male    34567
14  15   jjjj    male    87654
15  16   iiii  female    34567
16  17   mmmm  female     1234
17  18  nnnnn  female    23456
18  19   oooo  female     5555
19  20   pppp    male     3455

In [33]:
df.isnull()

       id   name  gender  salary
0   False  False   False   False
1   False  False   False   False
2   False  False   False   False
3   False  False   False   False
4   False  False   False   False
5   False  False   False   False
6   False  False   False   False
7   False  False   False   False
8   False  False   False   False
9   False  False   False   False
10  False  False   False   False
11  False  False   False   False
12  False  False   False   False
13  False  False   False   False
14  False  False   False   False
15  False  False   False   False
16  False  False   False   False
17  False  False   False   False
18  False  False   False   False
19  False  False   False   False

In [34]:
df.describe()

             id        salary
count  20.00000  2.000000e+01
mean   10.50000  2.137610e+05
std     5.91608  7.669659e+05
min     1.00000  3.450000e+02
25%     5.75000  7.129250e+03
50%    10.50000  2.234500e+04
75%    15.25000  4.516950e+04
max    20.00000  3.456578e+06

In [35]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 20 entries, 0 to 19
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   id      20 non-null     int64
 1   name    20 non-null     object
 2   gender  20 non-null     object
 3   salary  20 non-null     int64
dtypes: int64(2), object(2)
memory usage: 772.0+ bytes

In [36]:
df.shape

(20, 4)

In [37]:
df.nunique

<bound method DataFrame.nunique of     id   name  gender   salary
0    1   aaaa    male    10000
1    2   bbbb  female     8000
2    3  ccccc    male   120000
3    4   dddd    male    45000
4    5   eeee  female   334567
5    6   ffff  female    21234
6    7   gggg  female     2345
7    8   hhhh  female    23456
8    9   iiii    male     7654
9   10    jjj    male  3456578
10  11   kkkk    male    45678
11  12   llll    male      345
12  13   mmmm  female     9876
13  14  nnnnn    male    34567
14  15   jjjj    male    87654
15  16   iiii  female    34567
16  17   mmmm  female     1234
17  18  nnnnn  female    23456
18  19   oooo  female     5555
19  20   pppp    male     3455>

In [38]:
df.sample()

   id   name gender  salary
2   3  ccccc   male  120000

In [39]:
df.sum()

id                                                      210
name      aaaabbbbcccccddddeeeeffffgggghhhhiiiijjjkkkkll...
gender    malefemalemalemalefemalefemalefemalefemalemale...
salary                                              4275221
dtype: object

In [42]:
s=pd.Series([1,2,3,4,5,6,7,8,9])

In [43]:
s.fillna(0)

0    1
1    2
2    3
3    4
4    5
5    6
6    7
7    8
8    9
dtype: int64

In [45]:
df.fillna(0)

    id   name  gender   salary
0    1   aaaa    male    10000
1    2   bbbb  female     8000
2    3  ccccc    male   120000
3    4   dddd    male    45000
4    5   eeee  female   334567
5    6   ffff  female    21234
6    7   gggg  female     2345
7    8   hhhh  female    23456
8    9   iiii    male     7654
9   10    jjj    male  3456578
10  11   kkkk    male    45678
11  12   llll    male      345
12  13   mmmm  female     9876
13  14  nnnnn    male    34567
14  15   jjjj    male    87654
15  16   iiii  female    34567
16  17   mmmm  female     1234
17  18  nnnnn  female    23456
18  19   oooo  female     5555
19  20   pppp    male     3455

In [46]:
df.sum()

id                                                      210
name      aaaabbbbcccccddddeeeeffffgggghhhhiiiijjjkkkkll...
gender    malefemalemalemalefemalefemalefemalefemalemale...
salary                                              4275221
dtype: object

In [47]:
df.value_counts()

id  name   gender  salary
1   aaaa   male    10000      1
2   bbbb   female  8000       1
19  oooo   female  5555       1
18  nnnnn  female  23456      1
17  mmmm   female  1234       1
16  iiii   female  34567      1
15  jjjj   male    87654      1
14  nnnnn  male    34567      1
13  mmmm   female  9876       1
12  llll   male    345        1
11  kkkk   male    45678      1
10  jjj    male    3456578    1
9   iiii   male    7654       1
8   hhhh   female  23456      1
7   gggg   female  2345       1
6   ffff   female  21234      1
5   eeee   female  334567     1
4   dddd   male    45000      1
3   ccccc  male    120000     1
20  pppp   male    3455       1
Name: count, dtype: int64

In [49]:
df.columns

Index(['id', 'name', 'gender', 'salary'], dtype='object')

In [55]:
df.iloc()

In [58]:
s1=pd.Series([0,1,2,3,4])
s2=pd.Series([5,6,7,8,9])

In [60]:
pd.concat([s1,s2])

0    0
1    1
2    2
3    3
4    4
0    5
1    6
2    7
3    8
4    9
dtype: int64

In [61]:
df.count()

id        20
name      20
gender    20
salary    20
dtype: int64

In [62]:
print(df)

    id   name  gender   salary
0    1   aaaa    male    10000
1    2   bbbb  female     8000
2    3  ccccc    male   120000
3    4   dddd    male    45000
4    5   eeee  female   334567
5    6   ffff  female    21234
6    7   gggg  female     2345
7    8   hhhh  female    23456
8    9   iiii    male     7654
9   10    jjj    male  3456578
10  11   kkkk    male    45678
11  12   llll    male      345
12  13   mmmm  female     9876
13  14  nnnnn    male    34567
14  15   jjjj    male    87654
15  16   iiii  female    34567
16  17   mmmm  female     1234
17  18  nnnnn  female    23456
18  19   oooo  female     5555
19  20   pppp    male     3455

In [65]:
df['tax']=df.salary*0.10
print(df)

    id   name  gender   salary       tax
0    1   aaaa    male    10000    1000.0
1    2   bbbb  female     8000     800.0
2    3  ccccc    male   120000   12000.0
3    4   dddd    male    45000    4500.0
4    5   eeee  female   334567   33456.7
5    6   ffff  female    21234    2123.4
6    7   gggg  female     2345     234.5
7    8   hhhh  female    23456    2345.6
8    9   iiii    male     7654     765.4
9   10    jjj    male  3456578  345657.8
10  11   kkkk    male    45678    4567.8
11  12   llll    male      345      34.5
12  13   mmmm  female     9876     987.6
13  14  nnnnn    male    34567    3456.7
14  15   jjjj    male    87654    8765.4
15  16   iiii  female    34567    3456.7
16  17   mmmm  female     1234     123.4
17  18  nnnnn  female    23456    2345.6
18  19   oooo  female     5555     555.5
19  20   pppp    male     3455     345.5

In [66]:
for i in range(len(df)):
    print(df.loc[i])

id             1
name        aaaa
gender      male
salary     10000
tax       1000.0
Name: 0, dtype: object
id             2
name        bbbb
gender    female
salary      8000
tax        800.0
Name: 1, dtype: object
id              3
name        ccccc
gender       male
salary     120000
tax       12000.0
Name: 2, dtype: object
id             4
name        dddd
gender      male
salary     45000
tax       4500.0
Name: 3, dtype: object
id              5
name         eeee
gender     female
salary     334567
tax       33456.7
Name: 4, dtype: object
id             6
name        ffff
gender    female
salary     21234
tax       2123.4
Name: 5, dtype: object
id             7
name        gggg
gender    female
salary      2345
tax        234.5
Name: 6, dtype: object
id             8
name        hhhh
gender    female
salary     23456
tax       2345.6
Name: 7, dtype: object
id            9
name       iiii
gender     male
salary     7654
tax       765.4
Name: 8, dtype: object
id              10
name           jjj
gender        male
salary     3456578
tax       345657.8
Name: 9, dtype: object
id            11
name        kkkk
gender      male
salary     45678
tax       4567.8
Name: 10, dtype: object
id          12
name      llll
gender    male
salary     345
tax       34.5
Name: 11, dtype: object
id            13
name        mmmm
gender    female
salary      9876
tax        987.6
Name: 12, dtype: object
id            14
name       nnnnn
gender      male
salary     34567
tax       3456.7
Name: 13, dtype: object
id            15
name        jjjj
gender      male
salary     87654
tax       8765.4
Name: 14, dtype: object
id            16
name        iiii
gender    female
salary     34567
tax       3456.7
Name: 15, dtype: object
id            17
name        mmmm
gender    female
salary      1234
tax        123.4
Name: 16, dtype: object
id            18
name       nnnnn
gender    female
salary     23456
tax       2345.6
Name: 17, dtype: object
id            19
name        oooo
gender    female
salary      5555
tax        555.5
Name: 18, dtype: object
id           20
name       pppp
gender     male
salary     3455
tax       345.5
Name: 19, dtype: object

In [67]:
df.loc[2:10]

    id   name  gender   salary       tax
2    3  ccccc    male   120000   12000.0
3    4   dddd    male    45000    4500.0
4    5   eeee  female   334567   33456.7
5    6   ffff  female    21234    2123.4
6    7   gggg  female     2345     234.5
7    8   hhhh  female    23456    2345.6
8    9   iiii    male     7654     765.4
9   10    jjj    male  3456578  345657.8
10  11   kkkk    male    45678    4567.8

In [68]:
df['gender']=='male'

0      True
1     False
2      True
3      True
4     False
5     False
6     False
7     False
8      True
9      True
10     True
11     True
12    False
13     True
14     True
15    False
16    False
17    False
18    False
19     True
Name: gender, dtype: bool

In [70]:
df.sort_values(by='salary')[-2:-1]

   id  name  gender  salary      tax
4   5  eeee  female  334567  33456.7

In [1]:
import pandas as pd

In [3]:
df=pd.read_csv('ADANIPORTS.csv')

In [4]:
print(df)

            Date      Symbol Series  Prev Close    Open     High     Low
0     2007-11-27  MUNDRAPORT     EQ      440.00  770.00  1050.00  770.00  \
1     2007-11-28  MUNDRAPORT     EQ      962.90  984.00   990.00  874.00
2     2007-11-29  MUNDRAPORT     EQ      893.90  909.00   914.75  841.00
3     2007-11-30  MUNDRAPORT     EQ      884.20  890.00   958.00  890.00
4     2007-12-03  MUNDRAPORT     EQ      921.55  939.75   995.00  922.00
...          ...         ...    ...         ...     ...      ...     ...
3317  2021-04-26  ADANIPORTS     EQ      725.35  733.00   739.65  728.90
3318  2021-04-27  ADANIPORTS     EQ      730.75  735.00   757.50  727.35
3319  2021-04-28  ADANIPORTS     EQ      749.15  755.00   760.00  741.10
3320  2021-04-29  ADANIPORTS     EQ      746.25  753.20   765.85  743.40
3321  2021-04-30  ADANIPORTS     EQ      746.75  739.00   759.45  724.50

       Last   Close    VWAP    Volume      Turnover    Trades
0     959.0  962.90  984.72  27294366  2.687719e+15       NaN  \
1     885.0  893.90  941.38   4581338  4.312765e+14       NaN
2     887.0  884.20  888.09   5124121  4.550658e+14       NaN
3     929.0  921.55  929.17   4609762  4.283257e+14       NaN
4     980.0  969.30  965.65   2977470  2.875200e+14       NaN
...     ...     ...     ...       ...           ...       ...
3317  729.2  730.75  733.25   9390549  6.885658e+14  116457.0
3318  748.6  749.15  747.67  20573107  1.538191e+15  236896.0
3319  743.4  746.25  751.02  11156977  8.379106e+14  130847.0
3320  746.4  746.75  753.06  13851910  1.043139e+15  153293.0
3321  726.4  730.05  743.35  12600934  9.366911e+14  132141.0

      Deliverable Volume  %Deliverble
0                9859619       0.3612
1                1453278       0.3172
2                1069678       0.2088
3                1260913       0.2735
4                 816123       0.2741
...                  ...          ...
3317              838079       0.0892
3318             1779639       0.0865
3319             1342353       0.1203
3320             1304895       0.0942
3321             3514692       0.2789

[3322 rows x 15 columns]

In [6]:
df[['Date','Symbol','Series']]

            Date      Symbol Series
0     2007-11-27  MUNDRAPORT     EQ
1     2007-11-28  MUNDRAPORT     EQ
2     2007-11-29  MUNDRAPORT     EQ
3     2007-11-30  MUNDRAPORT     EQ
4     2007-12-03  MUNDRAPORT     EQ
...          ...         ...    ...
3317  2021-04-26  ADANIPORTS     EQ
3318  2021-04-27  ADANIPORTS     EQ
3319  2021-04-28  ADANIPORTS     EQ
3320  2021-04-29  ADANIPORTS     EQ
3321  2021-04-30  ADANIPORTS     EQ

[3322 rows x 3 columns]

In [7]:
df=pd.read_csv('mycsv.csv')

In [8]:
print(df)

    id   name  gender   salary
0    1   aaaa    male    10000
1    2   bbbb  female     8000
2    3  ccccc    male   120000
3    4   dddd    male    45000
4    5   eeee  female   334567
5    6   ffff  female    21234
6    7   gggg  female     2345
7    8   hhhh  female    23456
8    9   iiii    male     7654
9   10    jjj    male  3456578
10  11   kkkk    male    45678
11  12   llll    male      345
12  13   mmmm  female     9876
13  14  nnnnn    male    34567
14  15   jjjj    male    87654
15  16   iiii  female    34567
16  17   mmmm  female     1234
17  18  nnnnn  female    23456
18  19   oooo  female     5555
19  20   pppp    male     3455

In [9]:
df[['id','name','gender','salary']]

    id   name  gender   salary
0    1   aaaa    male    10000
1    2   bbbb  female     8000
2    3  ccccc    male   120000
3    4   dddd    male    45000
4    5   eeee  female   334567
5    6   ffff  female    21234
6    7   gggg  female     2345
7    8   hhhh  female    23456
8    9   iiii    male     7654
9   10    jjj    male  3456578
10  11   kkkk    male    45678
11  12   llll    male      345
12  13   mmmm  female     9876
13  14  nnnnn    male    34567
14  15   jjjj    male    87654
15  16   iiii  female    34567
16  17   mmmm  female     1234
17  18  nnnnn  female    23456
18  19   oooo  female     5555
19  20   pppp    male     3455

In [10]:
df['tax']=df.salary*0.10

In [11]:
print(df)

    id   name  gender   salary       tax
0    1   aaaa    male    10000    1000.0
1    2   bbbb  female     8000     800.0
2    3  ccccc    male   120000   12000.0
3    4   dddd    male    45000    4500.0
4    5   eeee  female   334567   33456.7
5    6   ffff  female    21234    2123.4
6    7   gggg  female     2345     234.5
7    8   hhhh  female    23456    2345.6
8    9   iiii    male     7654     765.4
9   10    jjj    male  3456578  345657.8
10  11   kkkk    male    45678    4567.8
11  12   llll    male      345      34.5
12  13   mmmm  female     9876     987.6
13  14  nnnnn    male    34567    3456.7
14  15   jjjj    male    87654    8765.4
15  16   iiii  female    34567    3456.7
16  17   mmmm  female     1234     123.4
17  18  nnnnn  female    23456    2345.6
18  19   oooo  female     5555     555.5
19  20   pppp    male     3455     345.5

In [13]:
for i in range(len(df)):
    print(df.iloc[i])

id             1
name        aaaa
gender      male
salary     10000
tax       1000.0
Name: 0, dtype: object
id             2
name        bbbb
gender    female
salary      8000
tax        800.0
Name: 1, dtype: object
id              3
name        ccccc
gender       male
salary     120000
tax       12000.0
Name: 2, dtype: object
id             4
name        dddd
gender      male
salary     45000
tax       4500.0
Name: 3, dtype: object
id              5
name         eeee
gender     female
salary     334567
tax       33456.7
Name: 4, dtype: object
id             6
name        ffff
gender    female
salary     21234
tax       2123.4
Name: 5, dtype: object
id             7
name        gggg
gender    female
salary      2345
tax        234.5
Name: 6, dtype: object
id             8
name        hhhh
gender    female
salary     23456
tax       2345.6
Name: 7, dtype: object
id            9
name       iiii
gender     male
salary     7654
tax       765.4
Name: 8, dtype: object
id              10
name           jjj
gender        male
salary     3456578
tax       345657.8
Name: 9, dtype: object
id            11
name        kkkk
gender      male
salary     45678
tax       4567.8
Name: 10, dtype: object
id          12
name      llll
gender    male
salary     345
tax       34.5
Name: 11, dtype: object
id            13
name        mmmm
gender    female
salary      9876
tax        987.6
Name: 12, dtype: object
id            14
name       nnnnn
gender      male
salary     34567
tax       3456.7
Name: 13, dtype: object
id            15
name        jjjj
gender      male
salary     87654
tax       8765.4
Name: 14, dtype: object
id            16
name        iiii
gender    female
salary     34567
tax       3456.7
Name: 15, dtype: object
id            17
name        mmmm
gender    female
salary      1234
tax        123.4
Name: 16, dtype: object
id            18
name       nnnnn
gender    female
salary     23456
tax       2345.6
Name: 17, dtype: object
id            19
name        oooo
gender    female
salary      5555
tax        555.5
Name: 18, dtype: object
id           20
name       pppp
gender     male
salary     3455
tax       345.5
Name: 19, dtype: object

In [18]:
for i in range(len(df)):
    print(df.iloc[i])

id             1
name        aaaa
gender      male
salary     10000
tax       1000.0
Name: 0, dtype: object
id             2
name        bbbb
gender    female
salary      8000
tax        800.0
Name: 1, dtype: object
id              3
name        ccccc
gender       male
salary     120000
tax       12000.0
Name: 2, dtype: object
id             4
name        dddd
gender      male
salary     45000
tax       4500.0
Name: 3, dtype: object
id              5
name         eeee
gender     female
salary     334567
tax       33456.7
Name: 4, dtype: object
id             6
name        ffff
gender    female
salary     21234
tax       2123.4
Name: 5, dtype: object
id             7
name        gggg
gender    female
salary      2345
tax        234.5
Name: 6, dtype: object
id             8
name        hhhh
gender    female
salary     23456
tax       2345.6
Name: 7, dtype: object
id            9
name       iiii
gender     male
salary     7654
tax       765.4
Name: 8, dtype: object
id              10
name           jjj
gender        male
salary     3456578
tax       345657.8
Name: 9, dtype: object
id            11
name        kkkk
gender      male
salary     45678
tax       4567.8
Name: 10, dtype: object
id          12
name      llll
gender    male
salary     345
tax       34.5
Name: 11, dtype: object
id            13
name        mmmm
gender    female
salary      9876
tax        987.6
Name: 12, dtype: object
id            14
name       nnnnn
gender      male
salary     34567
tax       3456.7
Name: 13, dtype: object
id            15
name        jjjj
gender      male
salary     87654
tax       8765.4
Name: 14, dtype: object
id            16
name        iiii
gender    female
salary     34567
tax       3456.7
Name: 15, dtype: object
id            17
name        mmmm
gender    female
salary      1234
tax        123.4
Name: 16, dtype: object
id            18
name       nnnnn
gender    female
salary     23456
tax       2345.6
Name: 17, dtype: object
id            19
name        oooo
gender    female
salary      5555
tax        555.5
Name: 18, dtype: object
id           20
name       pppp
gender     male
salary     3455
tax       345.5
Name: 19, dtype: object

In [19]:
df.loc[2:6]

   id   name  gender  salary      tax
2   3  ccccc    male  120000  12000.0
3   4   dddd    male   45000   4500.0
4   5   eeee  female  334567  33456.7
5   6   ffff  female   21234   2123.4
6   7   gggg  female    2345    234.5

In [20]:
df['gender']=='male'

0      True
1     False
2      True
3      True
4     False
5     False
6     False
7     False
8      True
9      True
10     True
11     True
12    False
13     True
14     True
15    False
16    False
17    False
18    False
19     True
Name: gender, dtype: bool

In [22]:
max(df.salary)

3456578

In [23]:
sum(df.salary)

4275221

In [24]:
df.counnt()

AttributeError: 'DataFrame' object has no attribute 'counnt'

In [1]:
import pandas as pd

In [2]:
s=pd.Series([1,2,3,4,5])

In [3]:
s-1

0    0
1    1
2    2
3    3
4    4
dtype: int64

In [4]:
s*2

0     2
1     4
2     6
3     8
4    10
dtype: int64